home1.org
#+PROPERTY: header-args :results output :exports both :tangle home1.scm
#+PROPERTY: header-args:scheme  :session *scheme*

* Домашнее задание №1
  :PROPERTIES:
  :CUSTOM_ID: домашнее-задание-1
  :END:
При выполнении заданий *не используйте* присваивание и циклы. Избегайте
возврата логических значений из условных конструкций. Подготовьте
примеры для демонстрации работы разработанных вами процедур.

** 1. Определение дня недели по дате
   :PROPERTIES:
   :CUSTOM_ID: определение-дня-недели-по-дате
   :END:
Определите процедуру =day-of-week=, вычисляющую день недели по дате по
григорианскому календарю. Воспользуйтесь алгоритмом, описанным в
литературе. Пусть процедура принимает три формальных аргумента (день
месяца, месяц и год в виде целых чисел) и возвращает целое число ---
номер дня в неделе (0 --- воскресенье, 1 --- понедельник, ... 6 ---
суббота).

Пример вызова процедуры:

#+begin_example
  (day-of-week 04 12 1975) ⇒ 4
  (day-of-week 04 12 2006) ⇒ 1
  (day-of-week 29 05 2013) ⇒ 3
#+end_example

*** алгоритм Сакамото
[[https://www.geeksforgeeks.org/tomohiko-sakamotos-algorithm-finding-day-week/][источник]]
#+begin_src scheme :results none
(define (day-of-week-fixed-month day month year)
  (remainder (+ year
                (quotient year 4)
                (- (quotient year 100))
                (quotient year 400)
                (char->integer (string-ref "-bed=pen+mad." month))
                day)
             7))

(define (day-of-week day month year)
  (if (< month 3)
      (day-of-week-fixed-month day month (- year 1))
      (day-of-week-fixed-month day month year)))
#+end_src
