home1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-11 Sat 17:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Домашнее задание №1</title>
<meta name="author" content="Starovoytov Alexandr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Домашнее задание №1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#определение-дня-недели-по-дате">1. 1. Определение дня недели по дате</a>
<ul>
<li><a href="#orga35bb02">1.1. алгоритм Сакамото</a>
<ul>
<li><a href="#org33fd50a">1.1.1. тесты</a></li>
</ul>
</li>
<li><a href="#orgf38bca8">1.2. алгоритм Сакамото без <code>string-ref</code></a>
<ul>
<li><a href="#orgcb3dad3">1.2.1. тесты</a></li>
</ul>
</li>
<li><a href="#org07034b6">1.3. алгоритм с wikibooks</a>
<ul>
<li><a href="#org269af6b">1.3.1. тесты</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#действительные-корни-квадратного-уравнения">2. 2. Действительные корни квадратного уравнения</a>
<ul>
<li><a href="#org02c2f2c">2.1. решение</a></li>
<li><a href="#org08f5330">2.2. тесты</a></li>
</ul>
</li>
<li><a href="#нод-нок-и-проверка-числа-на-простоту">3. 3. НОД, НОК и проверка числа на простоту</a>
<ul>
<li><a href="#org407a9fc">3.1. решение</a></li>
<li><a href="#org3fb789b">3.2. тесты</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
При выполнении заданий <b>не используйте</b> присваивание и циклы. Избегайте
возврата логических значений из условных конструкций. Подготовьте
примеры для демонстрации работы разработанных вами процедур.
</p>

<div id="outline-container-определение-дня-недели-по-дате" class="outline-2">
<h2 id="определение-дня-недели-по-дате"><span class="section-number-2">1.</span> 1. Определение дня недели по дате</h2>
<div class="outline-text-2" id="text-определение-дня-недели-по-дате">
<p>
Определите процедуру <code>day-of-week</code>, вычисляющую день недели по дате по
григорианскому календарю. Воспользуйтесь алгоритмом, описанным в
литературе. Пусть процедура принимает три формальных аргумента (день
месяца, месяц и год в виде целых чисел) и возвращает целое число &#x2014;
номер дня в неделе (0 &#x2014; воскресенье, 1 &#x2014; понедельник, &#x2026; 6 &#x2014;
суббота).
</p>

<p>
Пример вызова процедуры:
</p>

<pre class="example" id="org1298642">
  (day-of-week 04 12 1975) ⇒ 4
  (day-of-week 04 12 2006) ⇒ 1
  (day-of-week 29 05 2013) ⇒ 3
</pre>
</div>

<div id="outline-container-orga35bb02" class="outline-3">
<h3 id="orga35bb02"><span class="section-number-3">1.1.</span> алгоритм Сакамото</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.geeksforgeeks.org/tomohiko-sakamotos-algorithm-finding-day-week/">источник</a>
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">day-of-week-fixed-month</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>remainder <span style="color: #98be65;">(</span>+ year
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>- <span style="color: #51afef;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">100</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">400</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>char-&gt;integer <span style="color: #51afef;">(</span>string-ref <span style="color: #98be65;">"-bed=pen+mad."</span> month<span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                day<span style="color: #98be65;">)</span>
             <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">day-of-week</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>&lt; month <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>day-of-week-fixed-month day month <span style="color: #a9a1e1;">(</span>- year <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>day-of-week-fixed-month day month year<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
