home1.tex
% Created 2021-11-26 Fri 23:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T2A]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[colorlinks]{hyperref}
\author{Starovoytov Alexandr}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Starovoytov Alexandr},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{Домашнее задание №1}
\label{домашнее-задание-1}
При выполнении заданий \textbf{не используйте} присваивание и циклы. Избегайте
возврата логических значений из условных конструкций. Подготовьте
примеры для демонстрации работы разработанных вами процедур.

\subsection{1. Определение дня недели по дате}
\label{определение-дня-недели-по-дате}
Определите процедуру \texttt{day-of-week}, вычисляющую день недели по дате по
григорианскому календарю. Воспользуйтесь алгоритмом, описанным в
литературе. Пусть процедура принимает три формальных аргумента (день
месяца, месяц и год в виде целых чисел) и возвращает целое число ---
номер дня в неделе (0 --- воскресенье, 1 --- понедельник, \ldots{} 6 ---
суббота).

Пример вызова процедуры:

\begin{verbatim}
  (day-of-week 04 12 1975) ⇒ 4
  (day-of-week 04 12 2006) ⇒ 1
  (day-of-week 29 05 2013) ⇒ 3
\end{verbatim}

\subsubsection{алгоритм Сакамото}
\label{sec:orgfab4958}
\href{https://www.geeksforgeeks.org/tomohiko-sakamotos-algorithm-finding-day-week/}{источник}
\begin{verbatim}
(define (day-of-week-fixed-month day month year)
  (remainder (+ year
                (quotient year 4)
                (- (quotient year 100))
                (quotient year 400)
                (char->integer (string-ref "-bed=pen+mad." month))
                day)
             7))

(define (day-of-week day month year)
  (if (< month 3)
      (day-of-week-fixed-month day month (- year 1))
      (day-of-week-fixed-month day month year)))
\end{verbatim}
\begin{enumerate}
\item тесты
\label{sec:org16c824c}
\begin{verbatim}
