home1.html
<div id="outline-container-org33fd50a" class="outline-4">
<h4 id="org33fd50a"><span class="section-number-4">1.1.1.</span> тесты</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">test-day-of-week</span> name<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display name<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"04 12 1975 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">04</span> <span style="color: #da8548; font-weight: bold;">12</span> <span style="color: #da8548; font-weight: bold;">1975</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"04 12 2006 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">04</span> <span style="color: #da8548; font-weight: bold;">12</span> <span style="color: #da8548; font-weight: bold;">2006</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"29 05 2013 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">29</span> <span style="color: #da8548; font-weight: bold;">05</span> <span style="color: #da8548; font-weight: bold;">2013</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"01 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"02 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">02</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"03 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">03</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"04 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">04</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"05 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">05</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">"06 01 1970 "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>display <span style="color: #98be65;">(</span>day-of-week <span style="color: #da8548; font-weight: bold;">06</span> <span style="color: #da8548; font-weight: bold;">01</span> <span style="color: #da8548; font-weight: bold;">1970</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>newline<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>test-day-of-week <span style="color: #98be65;">"Sakamoto's:"</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example" id="org3d813bc">
Sakamoto's:
04 12 1975 4
04 12 2006 1
29 05 2013 3
01 01 1970 4
02 01 1970 5
03 01 1970 6
04 01 1970 0
05 01 1970 1
06 01 1970 2

</pre>
</div>
</div>
</div>
