home1.html

<div id="outline-container-orgf38bca8" class="outline-3">
<h3 id="orgf38bca8"><span class="section-number-3">1.2.</span> алгоритм Сакамото без <code>string-ref</code></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">day-of-week-fixed-month</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>remainder <span style="color: #98be65;">(</span>+ year
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>- <span style="color: #51afef;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">100</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">400</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">or</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">6</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">8</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month  <span style="color: #da8548; font-weight: bold;">9</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">6</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month <span style="color: #da8548; font-weight: bold;">11</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span>
                    <span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #c678dd;">(</span>= month <span style="color: #da8548; font-weight: bold;">12</span><span style="color: #c678dd;">)</span> <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                day<span style="color: #98be65;">)</span>
             <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">day-of-week</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>&lt; month <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>day-of-week-fixed-month day month <span style="color: #a9a1e1;">(</span>- year <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>day-of-week-fixed-month day month year<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgcb3dad3" class="outline-4">
<h4 id="orgcb3dad3"><span class="section-number-4">1.2.1.</span> тесты</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>test-day-of-week <span style="color: #98be65;">"Sakamoto 2:"</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example" id="org18c715a">
Sakamoto 2:
04 12 1975 4
04 12 2006 1
29 05 2013 3
01 01 1970 4
02 01 1970 5
03 01 1970 6
04 01 1970 0
05 01 1970 1
06 01 1970 2

</pre>
</div>
</div>
</div>
<div id="outline-container-org07034b6" class="outline-3">
<h3 id="org07034b6"><span class="section-number-3">1.3.</span> алгоритм с wikibooks</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://ru.wikibooks.org/wiki/%D0%A0%D0%B5%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8_%D0%B0%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC%D0%BE%D0%B2/%D0%92%D0%B5%D1%87%D0%BD%D1%8B%D0%B9_%D0%BA%D0%B0%D0%BB%D0%B5%D0%BD%D0%B4%D0%B0%D1%80%D1%8C">ссылка</a>
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">calc-day-of-week2</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>remainder <span style="color: #98be65;">(</span>+ day
                <span style="color: #a9a1e1;">(</span>quotient <span style="color: #51afef;">(</span>* <span style="color: #da8548; font-weight: bold;">31</span> month<span style="color: #51afef;">)</span> <span style="color: #da8548; font-weight: bold;">12</span><span style="color: #a9a1e1;">)</span>
                year
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">4</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>- <span style="color: #51afef;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">100</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
                <span style="color: #a9a1e1;">(</span>quotient year <span style="color: #da8548; font-weight: bold;">400</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
             <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">day-of-week</span> day month year<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">or</span> <span style="color: #a9a1e1;">(</span>= month <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">(</span>= month <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>calc-day-of-week2 day <span style="color: #a9a1e1;">(</span>+ month <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">(</span>- year <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>calc-day-of-week2 day <span style="color: #a9a1e1;">(</span>- month <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #a9a1e1;">)</span> year<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org269af6b" class="outline-4">
<h4 id="org269af6b"><span class="section-number-4">1.3.1.</span> тесты</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>test-day-of-week <span style="color: #98be65;">"ru.wikibooks.org:"</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example" id="orgb6d971c">
ru.wikibooks.org:
04 12 1975 4
04 12 2006 1
29 05 2013 3
01 01 1970 4
02 01 1970 5
03 01 1970 6
04 01 1970 0
05 01 1970 1
06 01 1970 2

</pre>
</div>
</div>
</div>
</div>
