home1.tex

\subsubsection{алгоритм Сакамото без \texttt{string-ref}}
\label{sec:org9b5b7c0}
\begin{verbatim}
(define (day-of-week-fixed-month day month year)
  (remainder (+ year
                (quotient year 4)
                (- (quotient year 100))
                (quotient year 400)
                (or
                    (and (= month  1) 0)
                    (and (= month  2) 3)
                    (and (= month  3) 2)
                    (and (= month  4) 5)
                    (and (= month  5) 0)
                    (and (= month  6) 3)
                    (and (= month  7) 5)
                    (and (= month  8) 1)
                    (and (= month  9) 4)
                    (and (= month 10) 6)
                    (and (= month 11) 2)
                    (and (= month 12) 4))
                day)
             7))
(define (day-of-week day month year)
  (if (< month 3)
      (day-of-week-fixed-month day month (- year 1))
      (day-of-week-fixed-month day month year)))
\end{verbatim}
\begin{enumerate}
\item тесты
\label{sec:orgedf5e42}
\begin{verbatim}
(test-day-of-week "Sakamoto 2:")
\end{verbatim}

\begin{verbatim}
Sakamoto 2:
04 12 1975 4
04 12 2006 1
29 05 2013 3
01 01 1970 4
02 01 1970 5
03 01 1970 6
04 01 1970 0
05 01 1970 1
06 01 1970 2

\end{verbatim}
\end{enumerate}
\subsubsection{алгоритм с wikibooks}
\label{sec:org3cd3901}
\href{https://ru.wikibooks.org/wiki/\%D0\%A0\%D0\%B5\%D0\%B0\%D0\%BB\%D0\%B8\%D0\%B7\%D0\%B0\%D1\%86\%D0\%B8\%D0\%B8\_\%D0\%B0\%D0\%BB\%D0\%B3\%D0\%BE\%D1\%80\%D0\%B8\%D1\%82\%D0\%BC\%D0\%BE\%D0\%B2/\%D0\%92\%D0\%B5\%D1\%87\%D0\%BD\%D1\%8B\%D0\%B9\_\%D0\%BA\%D0\%B0\%D0\%BB\%D0\%B5\%D0\%BD\%D0\%B4\%D0\%B0\%D1\%80\%D1\%8C}{ссылка}
\begin{verbatim}
(define (calc-day-of-week2 day month year)
  (remainder (+ day
                (quotient (* 31 month) 12)
                year
                (quotient year 4)
                (- (quotient year 100))
                (quotient year 400))
             7))

(define (day-of-week day month year)
  (if (or (= month 1) (= month 2))
      (calc-day-of-week2 day (+ month 10) (- year 1))
      (calc-day-of-week2 day (- month 2) year)))
\end{verbatim}
\begin{enumerate}
\item тесты
\label{sec:org86e7df3}
\begin{verbatim}
(test-day-of-week "ru.wikibooks.org:")
\end{verbatim}

\begin{verbatim}
ru.wikibooks.org:
04 12 1975 4
04 12 2006 1
29 05 2013 3
01 01 1970 4
02 01 1970 5
03 01 1970 6
04 01 1970 0
05 01 1970 1
06 01 1970 2

\end{verbatim}
\end{enumerate}
