home1.org
** 2. Действительные корни квадратного уравнения
   :PROPERTIES:
   :CUSTOM_ID: действительные-корни-квадратного-уравнения
   :END:
Определите процедуру, принимающую коэффициенты /a/, /b/ и /c/
квадратного уравнения вида /ax/²+/bx/+/c/=0 и возвращающую список чисел
--- корней уравнения (один или два корня, или пустой список, если корней
нет).

*Указание:* для формирования списка используйте функцию =(list …)=:

#+begin_example
  (list)        → ()
  (list 10)     → (10)
  (list 10 11)  → (10 11)
#+end_example
*** решение
#+begin_src scheme :results none
(define (D a b c)
  (- (* b b)
     (* 4 a c)))

(define (quadratic_equation_by_D a b D)
  (if (>= D 0)
      (if (> D 0)
          (list (/ (+ (- b) (sqrt D)) (* 2 a))
                (/ (- (- b) (sqrt D)) (* 2 a)))
          (list (/ (- b) (* 2 a))))
      (list)))

(define (quadratic_equation a b c)
  (quadratic_equation_by_D a b (D a b c)))
#+end_src
*** тесты
#+begin_src scheme :exports both
(display (quadratic_equation 2 5 -3)) ;; -3 1/2
(newline)
(display (quadratic_equation 4 21 5)) ;; -5 -1/4
(newline)
(display (quadratic_equation 4 -12 9)) ;; 3/2
(newline)
(display (quadratic_equation 1 2 17)) ;; нет корней
(newline)
#+end_src

#+RESULTS:
: (1/2 -3)
: (-1/4 -5)
: (3/2)
: ()

** 3. НОД, НОК и проверка числа на простоту
   :PROPERTIES:
   :CUSTOM_ID: нод-нок-и-проверка-числа-на-простоту
   :END:
Определите:

- Процедуру =(my-gcd a b)=, возвращающую наибольший общий делитель чисел
  =a= и =b=. Поведение вашей процедуры должно быть идентично поведению
  встроенной процедуры =gcd=.

- Процедуру =(my-lcm a b)=, возвращающую наименьшее общее кратное чисел
  =a= и =b=. Используйте процедуру =my-gcd=, определенную вами ранее.
  Поведение вашей процедуры должно быть идентично поведению встроенной
  процедуры =lcm=.

- Процедуру =(prime? n)=, выполняющую проверку числа =n= на простоту и
  возвращающую =#t=, если число простое и =#f= в противном случае.

- Примеры вызова процедур:

#+begin_example
  (my-gcd 3542 2464) ⇒ 154
  (my-lcm 3 4)       ⇒  12
  (prime? 11)        ⇒  #t
  (prime? 12)        ⇒  #f
#+end_example
