home1.html

<div id="outline-container-действительные-корни-квадратного-уравнения" class="outline-2">
<h2 id="действительные-корни-квадратного-уравнения"><span class="section-number-2">2.</span> 2. Действительные корни квадратного уравнения</h2>
<div class="outline-text-2" id="text-действительные-корни-квадратного-уравнения">
<p>
Определите процедуру, принимающую коэффициенты <i>a</i>, <i>b</i> и <i>c</i>
квадратного уравнения вида /ax/²+/bx/+/c/=0 и возвращающую список чисел
&#x2014; корней уравнения (один или два корня, или пустой список, если корней
нет).
</p>

<p>
<b>Указание:</b> для формирования списка используйте функцию <code>(list …)</code>:
</p>

<pre class="example" id="orgf6a8431">
  (list)        → ()
  (list 10)     → (10)
  (list 10 11)  → (10 11)
</pre>
</div>
<div id="outline-container-org02c2f2c" class="outline-3">
<h3 id="org02c2f2c"><span class="section-number-3">2.1.</span> решение</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">D</span> a b c<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>- <span style="color: #98be65;">(</span>* b b<span style="color: #98be65;">)</span>
     <span style="color: #98be65;">(</span>* <span style="color: #da8548; font-weight: bold;">4</span> a c<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">quadratic_equation_by_D</span> a b D<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>&gt;= D <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> <span style="color: #a9a1e1;">(</span>&gt; D <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span>list <span style="color: #51afef;">(</span>/ <span style="color: #c678dd;">(</span>+ <span style="color: #98be65;">(</span>- b<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>sqrt D<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span>* <span style="color: #da8548; font-weight: bold;">2</span> a<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
                <span style="color: #51afef;">(</span>/ <span style="color: #c678dd;">(</span>- <span style="color: #98be65;">(</span>- b<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>sqrt D<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span>* <span style="color: #da8548; font-weight: bold;">2</span> a<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span>list <span style="color: #51afef;">(</span>/ <span style="color: #c678dd;">(</span>- b<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span>* <span style="color: #da8548; font-weight: bold;">2</span> a<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>list<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">quadratic_equation</span> a b c<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>quadratic_equation_by_D a b <span style="color: #98be65;">(</span>D a b c<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org08f5330" class="outline-3">
<h3 id="org08f5330"><span class="section-number-3">2.2.</span> тесты</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span>display <span style="color: #c678dd;">(</span>quadratic_equation <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">5</span> <span style="color: #da8548; font-weight: bold;">-3</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">-3 1/2</span>
<span style="color: #51afef;">(</span>newline<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>display <span style="color: #c678dd;">(</span>quadratic_equation <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #da8548; font-weight: bold;">21</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">-5 -1/4</span>
<span style="color: #51afef;">(</span>newline<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>display <span style="color: #c678dd;">(</span>quadratic_equation <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #da8548; font-weight: bold;">-12</span> <span style="color: #da8548; font-weight: bold;">9</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">3/2</span>
<span style="color: #51afef;">(</span>newline<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>display <span style="color: #c678dd;">(</span>quadratic_equation <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">17</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1085;&#1077;&#1090; &#1082;&#1086;&#1088;&#1085;&#1077;&#1081;</span>
<span style="color: #51afef;">(</span>newline<span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
(1/2 -3)
(-1/4 -5)
(3/2)
()
</pre>
</div>
</div>
</div>

<div id="outline-container-нод-нок-и-проверка-числа-на-простоту" class="outline-2">
<h2 id="нод-нок-и-проверка-числа-на-простоту"><span class="section-number-2">3.</span> 3. НОД, НОК и проверка числа на простоту</h2>
<div class="outline-text-2" id="text-нод-нок-и-проверка-числа-на-простоту">
<p>
Определите:
</p>

<ul class="org-ul">
<li>Процедуру <code>(my-gcd a b)</code>, возвращающую наибольший общий делитель чисел
<code>a</code> и <code>b</code>. Поведение вашей процедуры должно быть идентично поведению
встроенной процедуры <code>gcd</code>.</li>

<li>Процедуру <code>(my-lcm a b)</code>, возвращающую наименьшее общее кратное чисел
<code>a</code> и <code>b</code>. Используйте процедуру <code>my-gcd</code>, определенную вами ранее.
Поведение вашей процедуры должно быть идентично поведению встроенной
процедуры <code>lcm</code>.</li>

<li>Процедуру <code>(prime? n)</code>, выполняющую проверку числа <code>n</code> на простоту и
возвращающую <code>#t</code>, если число простое и <code>#f</code> в противном случае.</li>

<li>Примеры вызова процедур:</li>
</ul>

<pre class="example" id="org84508e4">
  (my-gcd 3542 2464) ⇒ 154
  (my-lcm 3 4)       ⇒  12
  (prime? 11)        ⇒  #t
  (prime? 12)        ⇒  #f
</pre>
</div>
