home1.tex

\subsection{2. Действительные корни квадратного уравнения}
\label{действительные-корни-квадратного-уравнения}
Определите процедуру, принимающую коэффициенты \emph{a}, \emph{b} и \emph{c}
квадратного уравнения вида /ax/²+/bx/+/c/=0 и возвращающую список чисел
--- корней уравнения (один или два корня, или пустой список, если корней
нет).

\textbf{Указание:} для формирования списка используйте функцию \texttt{(list …)}:

\begin{verbatim}
  (list)        → ()
  (list 10)     → (10)
  (list 10 11)  → (10 11)
\end{verbatim}
\begin{verbatim}
(define (D a b c)
  (- (* b b)
     (* 4 a c)))

(define (quadratic_equation_by_D a b D)
  (if (>= D 0)
      (if (> D 0)
          (list (/ (+ (- b) (sqrt D)) (* 2 a))
                (/ (- (- b) (sqrt D)) (* 2 a)))
          (list (/ (- b) (* 2 a))))
      (list)))

(define (quadratic_equation a b c)
  (quadratic_equation_by_D a b (D a b c)))
\end{verbatim}
\subsubsection{тесты}
\label{sec:org23ebae3}
\begin{verbatim}
(display (quadratic_equation 2 5 -3)) ;; -3 1/2
(newline)
(display (quadratic_equation 4 21 5)) ;; -5 -1/4
(newline)
(display (quadratic_equation 4 -12 9)) ;; 3/2
(newline)
(display (quadratic_equation 1 2 17)) ;; нет корней
(newline)
\end{verbatim}

\begin{verbatim}
(1/2 -3)
(-1/4 -5)
(3/2)
()
\end{verbatim}

\subsection{3. НОД, НОК и проверка числа на простоту}
\label{нод-нок-и-проверка-числа-на-простоту}
Определите:

\begin{itemize}
\item Процедуру \texttt{(my-gcd a b)}, возвращающую наибольший общий делитель чисел
\texttt{a} и \texttt{b}. Поведение вашей процедуры должно быть идентично поведению
встроенной процедуры \texttt{gcd}.

\item Процедуру \texttt{(my-lcm a b)}, возвращающую наименьшее общее кратное чисел
\texttt{a} и \texttt{b}. Используйте процедуру \texttt{my-gcd}, определенную вами ранее.
Поведение вашей процедуры должно быть идентично поведению встроенной
процедуры \texttt{lcm}.

\item Процедуру \texttt{(prime? n)}, выполняющую проверку числа \texttt{n} на простоту и
возвращающую \texttt{\#t}, если число простое и \texttt{\#f} в противном случае.

\item Примеры вызова процедур:
\end{itemize}

\begin{verbatim}
  (my-gcd 3542 2464) ⇒ 154
  (my-lcm 3 4)       ⇒  12
  (prime? 11)        ⇒  #t
  (prime? 12)        ⇒  #f
\end{verbatim}
\begin{verbatim}
(define (my-gcd a b)
  (if (= b 0)
      a
