home1.tex
      (my-gcd b (remainder a b))))

(define (my-lcm a b)
  (quotient (* a b) (my-gcd a b)))

(define (recursive-prime-test n i)
  (or (> (* i i) n)
      (and
       (> (remainder n i) 0)
       (> (remainder n (+ i 2)) 0)
       (recursive-prime-test n (+ i 6)))))

(define (prime? n)
  (or (= n 2)
      (= n 3)
      (and (>= n 5)
           (> (remainder n 2) 0)
           (> (remainder n 3) 0)
           (recursive-prime-test n 5))))
\end{verbatim}
\subsubsection{тесты}
\label{sec:org2286e21}
\begin{verbatim}
(display (prime? 1))
(newline)
(display (prime? 2))
(newline)
(display (prime? 3))
(newline)
(display (prime? 4))
(newline)
(display (prime? 5))
(newline)
(display (prime? 6))
(newline)
(display (prime? 7))
(newline)
(display (prime? 8))
(newline)
(display (prime? 13))
(newline)
\end{verbatim}

\begin{verbatim}
#f
#t
#t
#f
#t
#f
#t
#f
#t
\end{verbatim}
\end{document}
